import React from "react";
import Slider from "react-slick";
import "slick-carousel/slick/slick.css";
import "slick-carousel/slick/slick-theme.css";
import UzbGerb from "../../assets/img/uzb_gerb.png";
import {StyledSLider} from './Slider.style'

function Sliders() {
  const settings = {
    dots: true,
    arrows: true,
    slidesToShow: 1,
    slidesToScroll: 1,
  };
  return (
    <div>
      <Slider {...settings}>
          <StyledSLider>
        <div className="slider_item">
          <div className="col-3">
            <div className="img_block">
              <img src={UzbGerb} alt="photo" />
              <p>
                <b>Министерство культуры Республики Узбекистан</b>
                <br />
                Директор центра ИКТ
              </p>
            </div>
          </div>
          <div className="col-9">
            <div className="text">
              <p>
                Министерство культуры Республики Узбекистан выражает глубокую
                признательность компании OKS Technologies&nbsp; за их
                плодотворную работу и правильное понятие поставленных задач. В
                процессе поисков будущих исполнителей данного проекта мы
                неоднократно обращались в разные фирмы, не находя даже
                примерного понимания нашего видения. И только в компании OKS
                Technologies буквально за считаные часы сотрудники компании
                сориентировались, презентовав подробные дизайн макеты, а далее и
                разработав по поставленным нами задачами техническое задание.
                Все было выполнено срок, точно следуя пунктам ТЗ, после было
                проведено подробное обучение наших сотрудников по работе с
                сайтом.
              </p>
            </div>
          </div>
        </div>
        </StyledSLider>
          <StyledSLider>
        <div className="slider_item">
          <div className="col-3">
            <div className="img_block">
              <img src={UzbGerb} alt="photo" />
              <p>
                <b>Министерство культуры Республики Узбекистан</b>
                <br />
                Директор центра ИКТ
              </p>
            </div>
          </div>
          <div className="col-9">
            <div className="text">
              <p>
                Министерство культуры Республики Узбекистан выражает глубокую
                признательность компании OKS Technologies&nbsp; за их
                плодотворную работу и правильное понятие поставленных задач. В
                процессе поисков будущих исполнителей данного проекта мы
                неоднократно обращались в разные фирмы, не находя даже
                примерного понимания нашего видения. И только в компании OKS
                Technologies буквально за считаные часы сотрудники компании
                сориентировались, презентовав подробные дизайн макеты, а далее и
                разработав по поставленным нами задачами техническое задание.
                Все было выполнено срок, точно следуя пунктам ТЗ, после было
                проведено подробное обучение наших сотрудников по работе с
                сайтом.
              </p>
            </div>
          </div>
        </div>
        </StyledSLider>
          <StyledSLider>
        <div className="slider_item">
          <div className="col-3">
            <div className="img_block">
              <img src={UzbGerb} alt="photo" />
              <p>
                <b>Министерство культуры Республики Узбекистан</b>
                <br />
                Директор центра ИКТ
              </p>
            </div>
          </div>
          <div className="col-9">
            <div className="text">
              <p>
                Министерство культуры Республики Узбекистан выражает глубокую
                признательность компании OKS Technologies&nbsp; за их
                плодотворную работу и правильное понятие поставленных задач. В
                процессе поисков будущих исполнителей данного проекта мы
                неоднократно обращались в разные фирмы, не находя даже
                примерного понимания нашего видения. И только в компании OKS
                Technologies буквально за считаные часы сотрудники компании
                сориентировались, презентовав подробные дизайн макеты, а далее и
                разработав по поставленным нами задачами техническое задание.
                Все было выполнено срок, точно следуя пунктам ТЗ, после было
                проведено подробное обучение наших сотрудников по работе с
                сайтом.
              </p>
            </div>
          </div>
        </div>
        </StyledSLider>
          <StyledSLider>
        <div className="slider_item">
          <div className="col-3">
            <div className="img_block">
              <img src={UzbGerb} alt="photo" />
              <p>
                <b>Министерство культуры Республики Узбекистан</b>
                <br />
                Директор центра ИКТ
              </p>
            </div>
          </div>
          <div className="col-9">
            <div className="text">
              <p>
                Министерство культуры Республики Узбекистан выражает глубокую
                признательность компании OKS Technologies&nbsp; за их
                плодотворную работу и правильное понятие поставленных задач. В
                процессе поисков будущих исполнителей данного проекта мы
                неоднократно обращались в разные фирмы, не находя даже
                примерного понимания нашего видения. И только в компании OKS
                Technologies буквально за считаные часы сотрудники компании
                сориентировались, презентовав подробные дизайн макеты, а далее и
                разработав по поставленным нами задачами техническое задание.
                Все было выполнено срок, точно следуя пунктам ТЗ, после было
                проведено подробное обучение наших сотрудников по работе с
                сайтом.
              </p>
            </div>
          </div>
        </div>
        </StyledSLider>
          <StyledSLider>
        <div className="slider_item">
          <div className="col-3">
            <div className="img_block">
              <img src={UzbGerb} alt="photo" />
              <p>
                <b>Министерство культуры Республики Узбекистан</b>
                <br />
                Директор центра ИКТ
              </p>
            </div>
          </div>
          <div className="col-9">
            <div className="text">
              <p>
                Министерство культуры Республики Узбекистан выражает глубокую
                признательность компании OKS Technologies&nbsp; за их
                плодотворную работу и правильное понятие поставленных задач. В
                процессе поисков будущих исполнителей данного проекта мы
                неоднократно обращались в разные фирмы, не находя даже
                примерного понимания нашего видения. И только в компании OKS
                Technologies буквально за считаные часы сотрудники компании
                сориентировались, презентовав подробные дизайн макеты, а далее и
                разработав по поставленным нами задачами техническое задание.
                Все было выполнено срок, точно следуя пунктам ТЗ, после было
                проведено подробное обучение наших сотрудников по работе с
                сайтом.
              </p>
            </div>
          </div>
        </div>
        </StyledSLider>
          <StyledSLider>
        <div className="slider_item">
          <div className="col-3">
            <div className="img_block">
              <img src={UzbGerb} alt="photo" />
              <p>
                <b>Министерство культуры Республики Узбекистан</b>
                <br />
                Директор центра ИКТ
              </p>
            </div>
          </div>
          <div className="col-9">
            <div className="text">
              <p>
                Министерство культуры Республики Узбекистан выражает глубокую
                признательность компании OKS Technologies&nbsp; за их
                плодотворную работу и правильное понятие поставленных задач. В
                процессе поисков будущих исполнителей данного проекта мы
                неоднократно обращались в разные фирмы, не находя даже
                примерного понимания нашего видения. И только в компании OKS
                Technologies буквально за считаные часы сотрудники компании
                сориентировались, презентовав подробные дизайн макеты, а далее и
                разработав по поставленным нами задачами техническое задание.
                Все было выполнено срок, точно следуя пунктам ТЗ, после было
                проведено подробное обучение наших сотрудников по работе с
                сайтом.
              </p>
            </div>
          </div>
        </div>
        </StyledSLider>
      </Slider>
    </div>
  );
}

export default Sliders;
